#+STARTUP: showall
#+OPTIONS: H:2
#+TITLE: Conducting Three-level Meta-analyses using the =metaSEM= Package
#+AUTHOR: Mike W.-L. Cheung
#+BABEL: :session *R* :results output :exports both :tangle yes
#+LATEX_HEADER: \usepackage[a4paper,margin=2.5cm]{geometry}
#+LaTeX_HEADER: \usepackage{framed}
#+LaTeX_HEADER: \usepackage{xcolor}
#+LaTeX_HEADER: \definecolor{shadecolor}{gray}{.9}
#+LaTeX_HEADER: \newenvironment{results}{\begin{shaded}}{\end{shaded}}

** Inspecting the data
Before running the analyses, we need to load the =metaSEM= library. The datasets are stored in the library. It is always a good idea to inspect the data before the analyses. We may display the first few cases of the dataset by using the =head()= command. 
#+BEGIN_SRC R :session *R* :results output :exports both :tangle yes
  #### Cooper et al. (2003)
  
  library("metaSEM")
  head(Cooper03)
#+END_SRC

#+RESULTS:
: Loading required package: OpenMx
:   District Study     y     v Year
: 1       11     1 -0.18 0.118 1976
: 2       11     2 -0.22 0.118 1976
: 3       11     3  0.23 0.144 1976
: 4       11     4 -0.30 0.144 1976
: 5       12     5  0.13 0.014 1989
: 6       12     6 -0.26 0.014 1989

** Preparing data
- Data in a three-level meta-analysis are usually stored in the [[http://wiki.stdout.org/rcookbook/Manipulating%20data/Converting%20data%20between%20wide%20and%20long%20format/][long format]], e.g., =Cooper03= in this example, whereas the SEM approach uses the wide format. 
- Suppose the maximum number of effect sizes in the level-2 unit is $k$ ($k=11$ in this example). Each cluster is represented by one row with $k=11$ variables representing the outcome effect size, say /y_1/ to /y_11/ in this example. The incomplete data are represented by =NA= (missing value). 
- Similarly, $k=11$ variables are required to represent the known sampling variances, say /v_1/ to /v_11/ in this example.
- If the covariates are at level 2, $k=11$ variables are also required to represent each of them. For example, =Year= is a level-2 covariate, /Year_1/ to /Year_11/ are required to represent it.
- Several extra steps are required to handle missing values. Missing values (represented by =NA= in =R=) are not allowed in /v_1/ to /v_11/ as they are definition variables. The missing data are converted into some arbitrary values, say =1e10= in this example. The actual value does not matter because the missing values will be removed before the analysis. It is because missing values in /y_1/ to /y_11/ (and /v_1/ to /v_11/) will be filtered out automatically by the use of FIML. 
#+BEGIN_SRC R :session *R* :results output :exports both :tangle yes
  #### Steps in Analyzing Three-level Meta-analysis in OpenMx

  #### Preparing data
  ## Load the library
  library(OpenMx)
  
  ## Get the dataset from the metaSEM library
  data(Cooper03, package="metaSEM")
  
  ## Make a copy of the original data
  my.long <- Cooper03

  ## Show the first few cases in my.long
  head(my.long)
#+END_SRC

#+RESULTS:
:   District Study     y     v Year
: 1       11     1 -0.18 0.118 1976
: 2       11     2 -0.22 0.118 1976
: 3       11     3  0.23 0.144 1976
: 4       11     4 -0.30 0.144 1976
: 5       12     5  0.13 0.014 1989
: 6       12     6 -0.26 0.014 1989

#+BEGIN_SRC R :session *R* :results output :exports both :tangle yes  
  ## Center the Year to increase numerical stability
  my.long$Year <- scale(my.long$Year, scale=FALSE)
  
  ## maximum no. of effect sizes in level-2
  k <- 11
  
  ## Create a variable called "time" to store: 1, 2, 3, ... k
  my.long$time <- c(unlist(sapply(split(my.long$y, my.long$District), 
                                  function(x) 1:length(x))))
  
  ## Convert long format to wide format by "District"
  my.wide <- reshape(my.long, timevar="time", idvar=c("District"), 
                     sep="_", direction="wide")

  ## NA in v is due to NA in y in wide format
  ## Replace NA with 1e10 in "v"
  temp <- my.wide[, paste("v_", 1:k, sep="")]
  temp[is.na(temp)] <- 1e10
  my.wide[, paste("v_", 1:k, sep="")] <- temp
  
  ## Replace NA with 0 in "Year"
  temp <- my.wide[, paste("Year_", 1:k, sep="")]
  temp[is.na(temp)] <- 0
  my.wide[, paste("Year_", 1:k, sep="")] <- temp

  ## Show the first few cases in my.wide
  head(my.wide)
#+END_SRC

